{
    "Informations personnelles": [
        "Martin DUPONT",
        "martin.dupont@gmail.com",
        "06 06 06 06 06",
        "Ingénieur informatique passionné avec une solide expérience dans le",
        "développement logiciel et la gestion de projets. Expert en conception et en",
        "implémentation de solutions informatiques novatrices. Capacité éprouvée à",
        "diriger des équipes et à résoudre des problèmes complexes, tout en respectant",
        "les délais et les exigences de qualité."
    ],
    "réseau social": [
        "linkedin.com/martindupont.test"
    ],
    "Expérience": [
        "Ingénieur Développeur Logiciel Principal, TechPro Solutions, Paris, France",
        "Avril 2025 – Présent",
        "• Conception et développement d’une plateforme SaaS innovante pour la",
        "gestion des ressources humaines, en utilisant principalement Java et",
        "• Supervision d’une équipe de cinq développeurs, en assurant la",
        "collaboratif.",
        "• Résolution proactive des problèmes de performance, ce qui a entraîné",
        "une réduction de 20 % du temps de chargement global de l’application.",
        "Développeur Full Stack, DataTech Entreprise, Paris, France",
        "• Participation active au développement de plusieurs applications web",
        "• Mise en œuvre de tests automatisés, ce qui a permis de réduire de 30 %",
        "les erreurs de production et d’améliorer la qualité globale du logiciel.",
        "• Collaboration étroite avec l’équipe UX/UI pour améliorer l’expérience",
        "utilisateur et l’ergonomie des applications.",
        "Développeur Stagiaire, TechNow, Paris, France",
        "• Contribution à la conception et au développement d’une application de",
        "gestion de base de données en utilisant Java et MySQL.",
        "• Collaboration étroite avec l’équipe de développement pour résoudre les",
        "• Participation à des réunions d’équipe régulières pour présenter les",
        "progrès et proposer des améliorations pour optimiser l’efficacité du",
        "processus de développement.",
        "• Gestion de projet : Méthodologies Agiles, Scrum"
    ],
    "Compétences techniques": [
        "Python.",
        "coordination des tâches et en maintenant un environnement de travail",
        "complexes en utilisant Angular, React et Node.js.",
        "• Langages de programmation : Java, Python, JavaScript, C++",
        "• Développement web : Angular, React, Node.js, HTML5, CSS3",
        "• Bases de données : MySQL, MongoDB",
        "• Analyse de données : R, MATLAB, Tableau",
        "• Systèmes d’exploitation : Windows, Linux",
        "Logiciels"
    ],
    "date": [
        "Mai 2022 – Janvier 2025",
        "Mai 2020 – Février 2021"
    ],
    "Formation": [
        "problèmes techniques et assurer la livraison en temps voulu.",
        "Master en Informatique – Spécialisation en Ingénierie Logicielle, École",
        "Polytechnique,",
        "Paris, 2019",
        "Licence en Informatique, Lycée Saint-Michel,"
    ],
    "logiciels": [
        "• Environnement de développement intégré (IDE) : IntelliJ, Eclipse, Visual",
        "Studio Code",
        "• Outils de gestion de version : Git, SVN",
        "• Outils de collaboration d’équipe : JIRA, Trello, Asana"
    ]
}